layer {
  name: "sample"
  type: "Data"
  top: "sample"
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "./Experiment/10/SAMPLE_TRAIN"
    batch_size: 60
    backend: LMDB
  }
  include: { phase: TRAIN }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  data_param {
    source: "./Experiment/10/LABEL_TRAIN"
    batch_size: 60
    backend: LMDB
  }
  include: { phase: TRAIN }
}
layer {
  name: "clip_marker"
  type: "Data"
  top: "cm"
  data_param {
    source: "./Experiment/10/CLIP_MARKER_TRAIN"
    batch_size: 60
    backend: LMDB
  }
  include: { phase: TRAIN }
}
layer {
  name: "sample_index"
  type: "Data"
  top: "si"
  data_param {
    source: "./Experiment/10/SAMPLE_INDEX_TRAIN"
    batch_size: 60
    backend: LMDB
  }
  include: { phase: TRAIN }
}

layer {
  name: "sample"
  type: "Data"
  top: "sample"
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "./Experiment/10/SAMPLE_TEST"
    batch_size: 20
    backend: LMDB
  }
  include: { phase: TEST }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  data_param {
    source: "./Experiment/10/LABEL_TEST"
    batch_size: 20
    backend: LMDB
  }
  include: { phase: TEST }
}
layer {
  name: "clip_marker"
  type: "Data"
  top: "cm"
  data_param {
    source: "./Experiment/10/CLIP_MARKER_TEST"
    batch_size: 20
    backend: LMDB
  }
  include: { phase: TEST }
}
layer {
  name: "sample_index"
  type: "Data"
  top: "si"
  data_param {
    source: "./Experiment/10/SAMPLE_INDEX_TEST"
    batch_size: 20
    backend: LMDB
  }
  include: { phase: TEST }
}


layer {
  name: "bn_1"
  type: "BatchNorm"
  bottom: "sample"
  top: "bn_1"
}
layer {
  name: "scale_1"
  type: "Scale"
  bottom: "bn_1"
  top: "scale_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu_3"
  type: "ReLU"
  bottom: "scale_1"
  top: "relu_3"
}
layer {
  name: "conv_1"
  type: "Convolution"
  bottom: "relu_3"
  top: "conv_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "pooling_1"
  type: "Pooling"
  bottom: "conv_1"
  top: "pooling_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bn_2"
  type: "BatchNorm"
  bottom: "pooling_1"
  top: "bn_2"
}
layer {
  name: "scale_2"
  type: "Scale"
  bottom: "bn_2"
  top: "scale_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu_1"
  type: "ReLU"
  bottom: "scale_2"
  top: "relu_1"
}
layer {
  name: "ip_1"
  type: "InnerProduct"
  bottom: "relu_1"
  top: "ip_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu_2"
  type: "ReLU"
  bottom: "ip_1"
  top: "relu_2"
}
layer {
  name: "dropout_1"
  type: "Dropout"
  bottom: "relu_2"
  top: "dropout_1"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "reshape_sample_1"
  type: "Reshape"
  bottom: "dropout_1"
  top: "reshape_sample_1"
  reshape_param {
    shape {
      dim: 20
      dim: 3
      dim: 4096
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "reshape_label_1"
  type: "Reshape"
  bottom: "label"
  top: "reshape_label_1"
  reshape_param {
    shape {
      dim: 20
      dim: 3
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "reshape_cm_1"
  type: "Reshape"
  bottom: "cm"
  top: "reshape_cm_1"
  reshape_param {
    shape {
      dim: 20
      dim: 3
    }
  }
  include: { phase: TRAIN }
}


layer {
  name: "reshape_sample_1"
  type: "Reshape"
  bottom: "dropout_1"
  top: "reshape_sample_1"
  reshape_param {
    shape {
      dim: 20
      dim: 1
      dim: 4096
    }
  }
  include: { phase: TEST }
}
layer {
  name: "reshape_label_1"
  type: "Reshape"
  bottom: "label"
  top: "reshape_label_1"
  reshape_param {
    shape {
      dim: 20
      dim: 1
    }
  }
  include: { phase: TEST }
}
layer {
  name: "reshape_cm_1"
  type: "Reshape"
  bottom: "cm"
  top: "reshape_cm_1"
  reshape_param {
    shape {
      dim: 20
      dim: 1
    }
  }
  include: { phase: TEST }
}



layer {
  name: "lstm_1"
  type: "LSTM"
  bottom: "reshape_sample_1"
  bottom: "reshape_cm_1"
  top: "lstm_1"
  recurrent_param {
    num_output: 256
    weight_filler {
      type: "uniform"
      min: -0.01
      max: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "dropout_2"
  type: "Dropout"
  bottom: "lstm_1"
  top: "dropout_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "ip_2"
  type: "InnerProduct"
  bottom: "lstm_1"
  top: "ip_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}
layer {
  name: "slice_sample_1"
  type: "Slice"
  bottom: "ip_2"
  top: "slice_sample_1_1"
  top: "slice_sample_1_2"
  top: "slice_sample_1_3"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
  }
  include: { phase: TRAIN }
}
layer {
  name: "reshape_sample_2_1"
  bottom: "slice_sample_1_1"
  top: "reshape_sample_2_1"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 20
      dim: 10
    }
  }
  include: { phase: TRAIN }
}

layer {
  name: "reshape_sample_2_2"
  bottom: "slice_sample_1_2"
  top: "reshape_sample_2_2"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 20
      dim: 10
    }
  }
  include: { phase: TRAIN }
}

layer {
  name: "reshape_sample_2_3"
  bottom: "slice_sample_1_3"
  top: "reshape_sample_2_3"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 20
      dim: 10
    }
  }
  include: { phase: TRAIN }
}

layer {
  name: "concate_sample_1"
  bottom: "reshape_sample_2_1"
  bottom: "reshape_sample_2_2"
  bottom: "reshape_sample_2_3"
  top: "concate_sample_1"
  type: "Concat"
  concat_param {
    axis: 0
  }
  include: { phase: TRAIN }
}


layer {
  name: "reshape_sample_2_1"
  bottom: "ip_2"
  top: "reshape_sample_2_1"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 20
      dim: 10
    }
  }
  include: { phase: TEST }
}


layer {
  name: "concate_sample_1"
  bottom: "reshape_sample_2_1"
  top: "concate_sample_1"
  type: "Concat"
  concat_param {
    axis: 0
  }
  include: { phase: TEST }
}


layer {
   name: "ip_3"
   bottom: "concate_sample_1"
   top: "ip_3"
   type: "InnerProduct"
   param {
     lr_mult: 1
     decay_mult: 1
   }
   param {
     lr_mult: 2
     decay_mult: 0
   }
   inner_product_param {
     num_output: 10
     weight_filler {
       type: "gaussian"
       std: 0.01
     }
     bias_filler {
       type: "constant"
       value: 0
     }
     axis: 1
   }
}   


layer {
  name: "slice_label_1"
  type: "Slice"
  bottom: "reshape_label_1"
  top: "slice_label_1_1"
  top: "slice_label_1_2"
  slice_param {
    axis: 0
    slice_point: 1
  }
}


layer {
  name: "reshape_label_2"
  bottom: "slice_label_1_1"
  top: "reshape_label_2"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 3
      dim: 1
    }
  }
  include: { phase: TRAIN }
}

layer {
  name: "reshape_label_2"
  bottom: "slice_label_1_1"
  top: "reshape_label_2"
  type: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 1
    }
  }
  include: { phase: TEST }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip_3"
  bottom: "reshape_label_2"
  top: "loss"
  include: { phase: TRAIN }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip_3"
  bottom: "reshape_label_2"
  top: "accuracy"
}







