layer {
  name: "sample"
  type: "Data"
  top: "sample"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "/research/tklab/personal/hshi/Caffe_Workspace/LIP-READING/Experiment/Database/Front_Input//1/SAMPLE_TEST"
    batch_size: 20
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/research/tklab/personal/hshi/Caffe_Workspace/LIP-READING/Experiment/Database/Front_Input//1/LABEL_TEST"
    batch_size: 20
    backend: LMDB
  }
}
layer {
  name: "cm"
  type: "Data"
  top: "cm"
  include {
    phase: TEST
  }
  data_param {
    source: "/research/tklab/personal/hshi/Caffe_Workspace/LIP-READING/Experiment/Database/Front_Input//1/CLIP_MARKER_TEST"
    batch_size: 20
    backend: LMDB
  }
}
layer {
  name: "si"
  type: "Data"
  top: "si"
  include {
    phase: TEST
  }
  data_param {
    source: "/research/tklab/personal/hshi/Caffe_Workspace/LIP-READING/Experiment/Database/Front_Input//1/SAMPLE_INDEX_TEST"
    batch_size: 20
    backend: LMDB
  }
}
layer {
  name: "bn_1"
  type: "BatchNorm"
  bottom: "sample"
  top: "bn_1"
}
layer {
  name: "scale_1"
  type: "Scale"
  bottom: "bn_1"
  top: "scale_1"
}
layer {
  name: "con_1"
  type: "Convolution"
  bottom: "scale_1"
  top: "con_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "con_2"
  type: "Convolution"
  bottom: "con_1"
  top: "con_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pooling_1"
  type: "Pooling"
  bottom: "con_2"
  top: "pooling_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "bn_2"
  type: "BatchNorm"
  bottom: "pooling_1"
  top: "bn_2"
}
layer {
  name: "scale_2"
  type: "Scale"
  bottom: "bn_2"
  top: "scale_2"
}
layer {
  name: "relu_1"
  type: "ReLU"
  bottom: "scale_2"
  top: "relu_1"
}
layer {
  name: "ip_1"
  type: "InnerProduct"
  bottom: "relu_1"
  top: "ip_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "dropout_1"
  type: "Dropout"
  bottom: "ip_1"
  top: "dropout_1"
  dropout_param {
    dropout_ratio: 0.6
  }
}
layer {
  name: "reshape_sample_1"
  type: "Reshape"
  bottom: "dropout_1"
  top: "reshape_sample_1"
  include {
    phase: TEST
  }
  reshape_param {
    shape {
      dim: 20
      dim: 1
      dim: 4096
    }
  }
}
layer {
  name: "reshape_cm_1"
  type: "Reshape"
  bottom: "cm"
  top: "reshape_cm_1"
  include {
    phase: TEST
  }
  reshape_param {
    shape {
      dim: 20
      dim: 1
    }
  }
}
layer {
  name: "lstm_1"
  type: "LSTM"
  bottom: "reshape_sample_1"
  bottom: "reshape_cm_1"
  top: "lstm_1"
  recurrent_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "lstm_2"
  type: "LSTM"
  bottom: "lstm_1"
  bottom: "reshape_cm_1"
  top: "lstm_2"
  recurrent_param {
    num_output: 256
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ip_2"
  type: "InnerProduct"
  bottom: "lstm_2"
  top: "ip_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}
layer {
  name: "reshape_sample_2_1"
  type: "Reshape"
  bottom: "ip_2"
  top: "reshape_sample_2_1"
  include {
    phase: TEST
  }
  reshape_param {
    shape {
      dim: 1
      dim: 20
      dim: 10
    }
  }
}
layer {
  name: "concate_sample_2"
  type: "Concat"
  bottom: "reshape_sample_2_1"
  top: "concate_sample_2"
  include {
    phase: TEST
  }
  concat_param {
    axis: 0
  }
}
layer {
  name: "ip_3"
  type: "InnerProduct"
  bottom: "concate_sample_2"
  top: "ip_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 1
  }
}
layer {
  name: "reshape_label_1"
  type: "Reshape"
  bottom: "label"
  top: "reshape_label_1"
  reshape_param {
    shape {
      dim: 20
      dim: -1
    }
  }
}
layer {
  name: "slice_label_1_1"
  type: "Slice"
  bottom: "reshape_label_1"
  top: "slice_label_1_1"
  top: "slice_label_1_2"
  slice_param {
    slice_point: 1
    axis: 0
  }
}
layer {
  name: "reshape_label_2"
  type: "Reshape"
  bottom: "slice_label_1_1"
  top: "reshape_label_2"
  include {
    phase: TEST
  }
  reshape_param {
    shape {
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip_3"
  bottom: "reshape_label_2"
  top: "accuracy"
}
